#+TITLE: Chap1

* Chap1, ยง3.9, Ex. 1
#+begin_quote
 What are the types of the following values?
#+end_quote

#+begin_src haskell :tangle programs/chap139-1.hs
:type ['a','b','c']
:type ('a','b','c')
:type [(False, '0'), (True, '1')]
:type ([False,True], ['0', '1'])
:type [tail, init, reverse]
#+end_src

#+begin_example
['a','b','c'] :: [Char]
('a','b','c') :: (Char, Char, Char)
[(False, '0'), (True, '1')] :: [(Bool, Char)]
([False,True], ['0', '1']) :: ([Bool], [Char])
[tail, init, reverse] :: [[a] -> [a]]
#+end_example

* Chap1, ยง3.9, Ex. 2
#+begin_quote
Write down definitions that have the following types; it does not matter what
#+end_quote

#+begin_quote
bools :: [Bool]
nums :: [[Int]]
add :: Int -> Int -> Int -> Int
copy :: a -> (a,a)
apply :: (a->b) -> a -> b
#+end_quote

#+begin_src haskell :tangle programs/chap139-2.hs
:type [True, True, False]
:type [[1,2],[2,1],[3,1],[3,3,3]]

bw_add x y z = x+y+z
:type bw_add
      
bw_copy a = (a,a)
:type bw_copy

bw_apply f x = (f x)
:type bw_apply
#+end_src

#+RESULTS:
: ghci> ghci> bw_apply :: (t1 -> t2) -> t1 -> t2

#+begin_example
[True, True, False] :: [Bool]
[[1,2],[2,1],[3,1],[3,3,3]] :: Num a => [[a]]
bw_add :: Num a => a -> a -> a -> a
bw_copy :: b -> (b, b)
bw_apply :: (t1 -> t2) -> t1 -> t2
#+end_example
